Конфигурация/src/InformationRegisters/ЦеныКвартир/ЦеныКвартир.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныКвартир</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаЗаСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/CommonModules/ЦеныКвартирыВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

 // ЦенаЗаСутки квартир.
// 
// Параметры:
//  Квартира - СправочникСсылка.Квартиры
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - ЦенаЗаСутки квартиры
//
Функция ЦенаКвартир(Квартира, Период = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Квартира", Квартира);
	
	РеквизитыЗаписи = РегистрыСведений.ЦеныКвартир.ПолучитьПоследнее(Период, Отбор);
	
	Возврат РеквизитыЗаписи.ЦенаЗаСутки;
	
КонецФункции

#КонецОбласти
